app/controllers/movies_controller.rb

    def set_movie
      @movie = Movie.find(params[:id])
---
SELECT  `movies`.* FROM `movies`  WHERE `movies`.`id` = 0 LIMIT 1