app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `login`, `password`, `updated_at`) VALUES ('2014-12-19 09:44:04', 'vanille', 'tutu', '2014-12-19 09:44:04')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `password` = 'tuto', `updated_at` = '2014-12-19 09:44:32' WHERE `users`.`id` = 1